<a href="https://colab.research.google.com/github/marammohamed123/tasks/blob/main/pandas%20exam.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#1: Find the average mileage of each salaries?
import pandas as pd
df=pd.read_csv("/content/ds_salaries.csv")
a = df.groupby('salary')
b = a['salary'].mean()
b

salary
4000            4000.0
8000            8000.0
8760            8760.0
9272            9272.0
10000          10000.0
               ...
6000000      6000000.0
7000000      7000000.0
8500000      8500000.0
11000000    11000000.0
30400000    30400000.0
Name: salary, Length: 272, dtype: float64

In [2]:
#2: Sort all salaries by location column
sort_location = df.sort_values(by=['company_location', 'salary_in_usd'], ascending=False)
print(sort_location)

     Unnamed: 0  work_year experience_level employment_type  \
238         238       2021               EN              FT
252         252       2021               EX              FT
33           33       2020               MI              FT
97           97       2021               MI              FT
157         157       2021               MI              FT
..          ...        ...              ...             ...
200         200       2021               MI              FT
244         244       2021               EN              FT
480         480       2022               SE              FT
24           24       2020               MI              FT
481         481       2022               SE              FT

                              job_title   salary salary_currency  \
238                      Data Scientist     4000             USD
252             Principal Data Engineer   600000             USD
33                   Research Scientist   450000             USD
97               Financial Data Analyst   450000             USD
157  Applied Machine Learning Scientist   423000             USD
..                                  ...      ...             ...
200                      Data Scientist    52000             EUR
244                        AI Scientist  1335000             INR
480           Machine Learning Engineer   120000             USD
24                  Lead Data Scientist   115000             USD
481           Machine Learning Engineer    65000             USD

     salary_in_usd employee_residence  remote_ratio company_location  \
238           4000                 VN             0               VN
252         600000                 US           100               US
33          450000                 US             0               US
97          450000                 US           100               US
157         423000                 US            50               US
..             ...                ...           ...              ...
200          61467                 DE            50               AT
244          18053                 IN           100               AS
480         120000                 AE           100               AE
24          115000                 AE             0               AE
481          65000                 AE           100               AE

    company_size
238            M
252            L
33             M
97             L
157            L
..           ...
200            M
244            S
480            S
24             L
481            S

[607 rows x 12 columns]

In [5]:
#3:Create two data frames using the following two Dicts, Merge two data frames, and append the second data frame as a new column to the first data frame.
from pandas.core.reshape.merge import merge
data1 = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
data2 = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df3=pd.merge(df1,df2,on='Company')
df3

Empty DataFrame
Columns: [Company, Price_x, Price_y]
Index: []